# Отчёт по лабораторной работе №2 «Знакомство со средой разработки Eclipse»

***УрФУ ИРИТ-РФТ  
В рамках изучения дисциплины  
«Программирование на Java»  
Студента группы РИЗ-200016у  
Кулакова Максима Ивановича***

***Преподаватель Архипов Николай Александрович***

## Цель работы
Поучение представления о написание программ на языке
программирования Java с использованием среды разработки 
Eclipse.

## Описание задачи
- Изучение справочных материалов;
- Изучение интерфейса IDE Eclipse;
- Решение задач на программирование, которые затрагивают следующие темы:
  - логические переменные,
  - условный оператор `if`,
  - тернарный оператор `(условие)?если истина:если ложно`,
  - арифметические операции,
  - побитовые операции.
- Оформление отчёта по лабораторной работе.

## Ход работы
В ходе работы было решено 10 задач по программированию 
(точнее 6, так как 4 задачи полностью повторяются). 
Листинг кода написанных программам представлен ниже.  

#### Задание №1
Напишите программу, которая проверяет, делится ли введенное
Пользователем число на 3.
```java
import java.util.Scanner;

public class Example1 {
    public static void main(String[] args) {
        var input = new Scanner(System.in);
        int x;

        System.out.print("Введите число: ");
        x = input.nextInt();

        System.out.println(((x % 3) == 0)?"Число делится на 3.":"Число не делится на 3, без остатка.");
    }
}
```

Вывод программы:
```text
Введите число: 5
Число не делится на 3, без остатка.
```

#### Задание №2
Напишите программу, которая проверяет, удовлетворяет ли введенное
пользователем число следующим критериям: при делении на 5 в остатке
получается 2, а при делении на 7 в остатке получается 1.
```java
import java.util.Scanner;

public class Example2 {
    public static void main(String[] args) {
        var input = new Scanner(System.in);
        boolean modBy5Is2, modBy7Is1;
        int x;

        System.out.print("Введите число: ");
        x = input.nextInt();
        modBy5Is2 = x % 5 == 2;
        modBy7Is1 = x % 7 == 1;

        System.out.printf("Число %d при делении на 5" + ((!modBy5Is2)?" не ":" ") + "имеет остаток 2\n\r", x);
        System.out.printf("Число %d при делении на 7" + ((!modBy7Is1)?" не ":" ") + "имеет остаток 1\n\r", x);
    }
}
```

Вывод программы:
```text
Введите число: 5
Число 5 при делении на 5 не имеет остаток 2
Число 5 при делении на 7 не имеет остаток 1
```

#### Задание №3
Напишите программу, которая проверяет, удовлетворяет ли введенное
пользователем число следующим критериям: число делится на 4, и при
этом оно не меньше 10.
```java
import java.util.Scanner;

public class Example3 {
    public static void main(String[] args) {
        var input = new Scanner(System.in);
        boolean divBy5, moreThat10;
        int x;

        System.out.print("Введите число: ");
        x = input.nextInt();

        divBy5 = x % 5 == 0;
        moreThat10 = x >= 10;

        System.out.printf("Число %d" + ((!divBy5)?" не ":" ") +
                "делится на 5 без остатка и" + ((moreThat10)?" не ":" ") +
                "меньше 10.\n\r", x);
    }
}
```

Вывод программы:
```text
Введите число: 5
Число 5 делится на 5 без остатка и меньше 10.
```

#### Задание №4
Напишите программу, которая проверяет, попадает ли введение
пользователем число в диапазон от 5 до 10 включительно.
```java
import java.util.Scanner;

public class Example4 {
    public static void main(String[] args) {
        var input = new Scanner(System.in);
        boolean moreThat4, lessThat11;
        int x;

        System.out.print("Введите число: ");
        x = input.nextInt();
        moreThat4 = x >= 5;
        lessThat11 = x <= 10;

        System.out.printf("Число %d" +
                ((moreThat4 && lessThat11)?" ":" не ") +
                "принадлежит [5; 10].\n\r", x);
    }
}
```

Вывод программы:
```text
Введите число: 5
Число 5 принадлежит [5; 10].
```

#### Задание №5
Напишите программу, которая проверяет, сколько тысяч во введенном
пользователем числе (определяется четвертая цифра справа в десятичном
представлении числа).
```java
import java.util.Scanner;

public class Example5 {
    public static void main(String[] args) {
        var input = new Scanner(System.in);
        int data, thousands;

        System.out.print("Введите число: ");
        data = input.nextInt();

        thousands = (data / 1000) % 10;

        System.out.printf("Число %d имеет %d тысяч.\n\r", data ,thousands);
    }
}
```

Вывод программы:
```text
Введите число: 2378560
Число 2378560 имеет 8 тысяч.
```

#### Задание №6
Напишите программу, которая проверяет, делится ли введенное
пользователем число на 3.

> [!NOTE]
> Задание №6 аналогично заданию №1.

```java
public class Example6 {
    public static void main(String[] args) {
        Example1.main(new String[0]);
    }
}
```

Вывод программы:
```text
Введите число: 592
Число не делится на 3, без остатка.
```

#### Задание №7
Напишите программу, которая проверяет, удовлетворяет ли введенное
пользователем число следующим критериям: при делении на 5 в остатке
получается 2, а при делении на 7 в остатке получается 1.

> [!NOTE]
> Задание №7 аналогично заданию №2.

```java
public class Example7 {
    public static void main(String[] args) {
        Example2.main(new String[0]);
    }
}
```

Вывод программы:
```text
Введите число: 22
Число 22 при делении на 5 имеет остаток 2
Число 22 при делении на 7 имеет остаток 1
```

#### Задание №8
Напишите программу, которая проверяет, удовлетворяет ли введенное
пользователем число следующим критериям: число делится на 4 и при этом
оно не меньше 10.

> [!NOTE]
> Задание №8 аналогично заданию №3.

```java
public class Example8 {
    public static void main(String[] args) {
        Example3.main(new String[0]);
    }
}
```

Вывод программы:
```text
Введите число: 40
Число 40 делится на 5 без остатка и не меньше 10.
```

#### Задание №9
Напишите программу, которая проверяет, попадает ли введенное
пользователем число в диапазон от 5 до 10 включительно.

> [!NOTE]
> Задание №9 аналогично заданию №4.

```java
public class Example9 {
    public static void main(String[] args) {
        Example4.main(new String[0]);
    }
}
```

Вывод программы:
```text
Введите число: 8
Число 8 принадлежит [5; 10].
```

#### Задание №10
Напишите программу, которая проверяет вторую справа цифру в
восьмеричном представлении числа, введенного пользователем. Число
водится в десятичном (обычном) представлении.

```java
import java.util.Scanner;

public class Example10 {
    public static void main(String[] args) {
        var input = new Scanner(System.in);
        int inputData, result;

        System.out.print("Введите число: ");

        inputData = input.nextInt();
        result = inputData & 0b111000;
        result >>= 3;

        System.out.printf("Во втором разряде в восьмеричной системе счисления, " +
                "число %d имеет цифру %d.\n\r", inputData, result);
    }
}
```

Вывод программы:
```text
Введите число: 61
Во втором разряде в восьмеричной системе счисления, число 61 имеет цифру 7.
```

## Вывод
В рамках второй лабораторной работы по изучению языка
программирования Java была рассмотрена IDE Eclipse, а
также ряд тем, таких как логические переменные, арифметические
и побитовые операции, условный операторы `if`, а также 
тернарный оператор `(условие)?если истина:если ложно`.

В результате было решено 10 задач (точнее 6), в рамках 
лабораторной работы. Листинг кода всех программ, был 
представлен в разделе **Ход работы**. Можно сказать,
что цель поставленная в рамках лабораторной работы достигнута,
а поставленные задачи выполнены.